# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

Then, print the DataFrame.
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [1]:
import pandas as pd

In [9]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
l = [4,8,15,16,23,42]
df = pd.DataFrame(l)
type(df[0])

pandas.core.series.Series

0     4
1     8
2    15
3    16
4    23
5    42
Name: 0, dtype: int64

In [10]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [12]:
list = [x for x in range(10)]

In [13]:
list

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [14]:
pd.Series(list)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [ ]:
# Q3. Create a Pandas DataFrame that contains the following data:
# Name
# Alice
# Bob
# Claire

# Age
# 25
# 30
# 27

# Gender
# Female
# Male
# Female

In [23]:
mydata1 = [["name", "age", "gender"],
          ["Alice", 25, "Female"],
          ["Bob",30,"Female"],
          ['Claire', 27, "Female"]
         ]
df= pd.DataFrame(mydata)

In [24]:
df

        0    1       2
0    name  age  gender
1   Alice   25  Female
2     Bob   30  Female
3  Claire   27  Female

In [ ]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional labeled data structure that represents a tabular data object with rows and columns. It is one of the primary data structures provided by the pandas library for data manipulation and analysis.

A DataFrame can be thought of as a collection of pandas Series objects, where each Series represents a column of the DataFrame. It provides a way to store and manipulate structured data efficiently. The columns in a DataFrame can be of different data types, such as numeric, string, boolean, etc.

On the other hand, a pandas Series is a one-dimensional labeled array capable of holding any data type. It is similar to a column in a spreadsheet or a single column of a DataFrame. Each element in a Series has a unique label, called the index.

In [ ]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['John', 'Emily', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Paris', 'London']}

df = pd.DataFrame(data)
print(df)

In [ ]:
import pandas as pd

# Creating a Series
ages = pd.Series([25, 30, 35], name='Age')
print(ages)

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some common functions you can use:

In [26]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['John', 'Emily', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Paris', 'London']}

df = pd.DataFrame(data)

print(df.head(2))  # Display the first 2 rows
print(df.tail(1))  # Display the last row

    Name  Age      City
0   John   25  New York
1  Emily   30     Paris
      Name  Age    City
2  Charlie   35  London

In [27]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['John', 'Emily', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Paris', 'London']}

df = pd.DataFrame(data)

df_sorted = df.sort_values('Age')  # Sort DataFrame by 'Age' column
print(df_sorted)

      Name  Age      City
0     John   25  New York
1    Emily   30     Paris
2  Charlie   35    London

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
A DataFrame in pandas is mutable, meaning you can modify its contents by adding, removing, or updating rows and columns. You can change the values in individual cells, update entire columns, or even reshape the DataFrame structure. This mutability makes DataFrame a powerful tool for data manipulation and analysis.

On the other hand, both Series and Panel are immutable in nature. Once created, you cannot modify their contents directly. However, you can create new Series or Panel objects based on the existing ones by applying operations or transformations.

To summarize:

DataFrame: Mutable
Series: Immutable
Panel: Immutable

# Q7. Create a DataFrame using multiple Series. Explain with an example.
To create a DataFrame using multiple Series, you can pass a dictionary of Series objects to the pd.DataFrame() function. The keys of the dictionary will become the column names, and the values will be the corresponding Series.

Here's an example that demonstrates how to create a DataFrame using multiple Series:

In [35]:
import pandas as pd 
name_scr = pd.Series(["Nir", "Renuka", "Mansi"])
age_src = pd.Series([24,27,26])
Location_src = pd.Series(["Phulambri", "Pune", "Nasik"])
data = {  "name" : name_scr, "Age" :age_src, "place" : Location_src }
df = pd.DataFrame(data)
df

     name  Age      place
0     Nir   24  Phulambri
1  Renuka   27       Pune
2   Mansi   26      Nasik

In [37]:
df.sort_values('Age')

     name  Age      place
0     Nir   24  Phulambri
2   Mansi   26      Nasik
1  Renuka   27       Pune